Reports/20211111_155441/TS_7_Validate SOAP API/20211111_155453/requests/main/0.har

{
  "log" : {
    "version" : "1.2",
    "pages" : [ ],
    "entries" : [ {
      "startedDateTime" : "2021-11-11T09:55:03.778Z",
      "request" : {
        "method" : "SOAP",
        "url" : "",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ {
          "name" : "Content-Type",
          "value" : "application/soap+xml; charset=utf-8"
        } ],
        "queryString" : [ ],
        "postData" : {
          "mimeType" : "application/soap+xml; charset=utf-8",
          "text" : "<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap12:Envelope xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:soap12=\"http://www.w3.org/2003/05/soap-envelope\">\n  <soap12:Body>\n    <CelsiusToFahrenheit xmlns=\"https://www.w3schools.com/xml/\">\n      <Celsius>20</Celsius>\n    </CelsiusToFahrenheit>\n  </soap12:Body>\n</soap12:Envelope>",
          "comment" : ""
        },
        "headersSize" : 0,
        "bodySize" : 0,
        "comment" : ""
      },
      "response" : {
        "status" : 200,
        "statusText" : "",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ {
          "name" : "Cache-Control",
          "value" : "private, max-age=0,public"
        }, {
          "name" : "Server",
          "value" : "Microsoft-IIS/10.0"
        }, {
          "name" : "Content-Security-Policy",
          "value" : "frame-ancestors 'self' https://mycourses.w3schools.com;"
        }, {
          "name" : "X-AspNet-Version",
          "value" : "4.0.30319"
        }, {
          "name" : "X-Content-Security-Policy",
          "value" : "frame-ancestors 'self' https://mycourses.w3schools.com;"
        }, {
          "name" : "#status#",
          "value" : "HTTP/1.1 200 OK"
        }, {
          "name" : "Content-Length",
          "value" : "399"
        }, {
          "name" : "Date",
          "value" : "Thu, 11 Nov 2021 09:55:47 GMT"
        }, {
          "name" : "Content-Type",
          "value" : "application/soap+xml; charset=utf-8"
        }, {
          "name" : "X-Powered-By",
          "value" : "ASP.NET"
        } ],
        "content" : {
          "size" : 399,
          "mimeType" : "application/xml",
          "text" : "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://www.w3.org/2003/05/soap-envelope\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><CelsiusToFahrenheitResponse xmlns=\"https://www.w3schools.com/xml/\"><CelsiusToFahrenheitResult>68</CelsiusToFahrenheitResult></CelsiusToFahrenheitResponse></soap:Body></soap:Envelope>",
          "comment" : ""
        },
        "redirectURL" : "",
        "headersSize" : 361,
        "bodySize" : 399,
        "comment" : ""
      },
      "cache" : { },
      "timings" : {
        "comment" : "",
        "ssl" : -1,
        "connect" : 2094,
        "wait" : 0,
        "blocked" : -1,
        "dns" : -1,
        "send" : 0,
        "receive" : 0
      },
      "comment" : "",
      "_katalonRequestInformation" : {
        "name" : "0",
        "testObjectId" : "Object Repository/OR_9_SOAP API/Celsius to Farenheit Conversion",
        "harId" : "ead52add-9a35-4913-91e2-bc8fe00568a2",
        "reportFolder" : null
      },
      "time" : 2094
    } ],
    "comment" : ""
  }
}